OS Design
=====
- SMEP and SMAP (supervisor mode execution prevention)
  - requires ivy bridge processor
  - cpu will trigger exception if RIP is ring 3 PTE but CS is ring 0
  - trivial to bypass through kernel heap spraying or return oriented programming (rop)
  - hard to implement in windows
- Hypervisor based CPU protection
  - Hyper-V cpu protection features
    - non priviliged instruction execution prevention (NPIEP)
      - restricts the use of SGDT, SIDT, SLDT, and SMSW  
        these instructions are only useful in ring 3 if you are trying to leak a kernel address
      - generates #UD exception
      - made cpu vendors look bad. on Tiger Lake implemented User Mode Instruction Prevention (UMIP)
    - restricted user mode (RUM)
      - Um pages are always RWX in EPTE (page table entry) tricks cpu to run arbitrary code as CPL0 by modifying PTE
      - made intel look bad. on Kaby Lake cpus OS uses MBEC (mode-based execution control)
        
        adds separate KNX vs UNX bits in EPTE to avoid EPT switch
        ```
        lkd> dx @$myUserdat->SystemCall
        @$myUserdat->SystemCall : 0x0 [Type: unsigned long]
        ```
        0x0 does not support MBEC, 0x1 MBEC support
- Software Guard Extensions (SGX)
  - supported since Skylake 
  - creates Enclaves to run in an isolated execution and memory context
  - enclaves have in memory encryption
  - must register with intel and all code in enclave must be signed

= [1]      - 0xfffff80709f44110 : ntkrnlmp!NtWorkerFactoryWorkerReady+0x0 - 4         =
= [2]      - 0xfffff8070a311f80 : ntkrnlmp!NtAcceptConnectPort+0x0        - 6         =
= [3]      - 0xfffff8070a4d7030 : ntkrnlmp!NtMapUserPhysicalPagesScatt... - 4         =
= [4]      - 0xfffff8070a2083b0 : ntkrnlmp!NtWaitForSingleObject+0x0      - 4         =
= [5]      - 0xfffff80709ffd970 : ntkrnlmp!NtCallbackReturn+0x0           - 4         =
= [6]      - 0xfffff8070a1f0ff0 : ntkrnlmp!NtReadFile+0x0                 - 9         =
= [7]      - 0xfffff8070a2186f0 : ntkrnlmp!NtDeviceIoControlFile+0x0      - 10        =
= [8]      - 0xfffff8070a1f03c0 : ntkrnlmp!NtWriteFile+0x0                - 9         =
= [9]      - 0xfffff8070a2e4320 : ntkrnlmp!NtRemoveIoCompletion+0x0       - 5         =
= [10]     - 0xfffff8070a2e3940 : ntkrnlmp!NtReleaseSemaphore+0x0         - 4         =
= [11]     - 0xfffff8070a20fee0 : ntkrnlmp!NtReplyWaitReceivePort+0x0     - 4         =
= [12]     - 0xfffff8070a2bf050 : ntkrnlmp!NtReplyPort+0x0                - 4         =
= [13]     - 0xfffff8070a2175d0 : ntkrnlmp!NtSetInformationThread+0x0     - 4         =
= [14]     - 0xfffff8070a216cc0 : ntkrnlmp!NtSetEvent+0x0                 - 4         =
= [15]     - 0xfffff8070a2080e0 : ntkrnlmp!NtClose+0x0                    - 4         =
= [16]     - 0xfffff8070a1e1310 : ntkrnlmp!NtQueryObject+0x0              - 5         =
= [17]     - 0xfffff8070a21bca0 : ntkrnlmp!NtQueryInformationFile+0x0     - 5         =
= [18]     - 0xfffff8070a2f1e60 : ntkrnlmp!NtOpenKey+0x0                  - 4         =
= [19]     - 0xfffff8070a1f9620 : ntkrnlmp!NtEnumerateValueKey+0x0        - 6         =
= [20]     - 0xfffff8070a246e00 : ntkrnlmp!NtFindAtom+0x0                 - 4         =
= [21]     - 0xfffff8070a2fe0d0 : ntkrnlmp!NtQueryDefaultLocale+0x0       - 4         =
= [22]     - 0xfffff8070a22e590 : ntkrnlmp!NtQueryKey+0x0                 - 5         =
= [23]     - 0xfffff8070a22ec30 : ntkrnlmp!NtQueryValueKey+0x0            - 6         =
= [24]     - 0xfffff8070a24c960 : ntkrnlmp!NtAllocateVirtualMemory+0x0    - 6         =
= [25]     - 0xfffff8070a1e3830 : ntkrnlmp!NtQueryInformationProcess+0x0  - 5         =
= [26]     - 0xfffff8070a2f27f0 : ntkrnlmp!NtWaitForMultipleObjects32+0x0 - 5         =
= [27]     - 0xfffff8070a2f9e80 : ntkrnlmp!NtWriteFileGather+0x0          - 9         =
= [28]     - 0xfffff8070a24da60 : ntkrnlmp!NtSetInformationProcess+0x0    - 4         =
= [29]     - 0xfffff8070a29dc10 : ntkrnlmp!NtCreateKey+0x0                - 7         =
= [30]     - 0xfffff8070a28d5f0 : ntkrnlmp!NtFreeVirtualMemory+0x0        - 4         =
= [31]     - 0xfffff8070a4c2070 : ntkrnlmp!NtImpersonateClientOfPort+0x0  - 4         =
= [32]     - 0xfffff8070a216bb0 : ntkrnlmp!NtReleaseMutant+0x0            - 4         =
```
- misc
  - with arbitrary write could find kthread and edit previous mode to kernel mode 

Core & Executive Machanisms
====
Object Manager
  - OBJECT_TYPE STRUCT
    ```
    lkd> dt nt!_OBJECT_TYPE
    +0x000 TypeList         : _LIST_ENTRY
    +0x010 Name             : _UNICODE_STRING
    +0x020 DefaultObject    : Ptr64 Void
    +0x028 Index            : UChar
    +0x02c TotalNumberOfObjects : Uint4B
    +0x030 TotalNumberOfHandles : Uint4B
    +0x034 HighWaterNumberOfObjects : Uint4B
    +0x038 HighWaterNumberOfHandles : Uint4B
    +0x040 TypeInfo         : _OBJECT_TYPE_INITIALIZER
    +0x0b8 TypeLock         : _EX_PUSH_LOCK
    +0x0c0 Key              : Uint4B
    +0x0c8 CallbackList     : _LIST_ENTRY
    ```
  - OBJECT_TYPE_INITIALIZER STRUCT
    ```
    lkd> dt nt!_OBJECT_TYPE_INITIALIZER
    +0x000 Length           : Uint2B
    +0x002 ObjectTypeFlags  : Uint2B
    +0x002 CaseInsensitive  : Pos 0, 1 Bit
    +0x002 UnnamedObjectsOnly : Pos 1, 1 Bit
    +0x002 UseDefaultObject : Pos 2, 1 Bit
    +0x002 SecurityRequired : Pos 3, 1 Bit
    +0x002 MaintainHandleCount : Pos 4, 1 Bit
    +0x002 MaintainTypeList : Pos 5, 1 Bit
    +0x002 SupportsObjectCallbacks : Pos 6, 1 Bit
    +0x002 CacheAligned     : Pos 7, 1 Bit
    +0x003 UseExtendedParameters : Pos 0, 1 Bit
    +0x003 Reserved         : Pos 1, 7 Bits
    +0x004 ObjectTypeCode   : Uint4B
    +0x008 InvalidAttributes : Uint4B
    +0x00c GenericMapping   : _GENERIC_MAPPING
    +0x01c ValidAccessMask  : Uint4B
    +0x020 RetainAccess     : Uint4B
    +0x024 PoolType         : _POOL_TYPE
    +0x028 DefaultPagedPoolCharge : Uint4B
    +0x02c DefaultNonPagedPoolCharge : Uint4B
    +0x030 DumpProcedure    : Ptr64     void 
    +0x038 OpenProcedure    : Ptr64     long 
    +0x040 CloseProcedure   : Ptr64     void 
    +0x048 DeleteProcedure  : Ptr64     void 
    +0x050 ParseProcedure   : Ptr64     long 
    +0x050 ParseProcedureEx : Ptr64     long 
    +0x058 SecurityProcedure : Ptr64     long 
    +0x060 QueryNameProcedure : Ptr64     long 
    +0x068 OkayToCloseProcedure : Ptr64     unsigned char 
    +0x070 WaitObjectFlagMask : Uint4B
    +0x074 WaitObjectFlagOffset : Uint2B
    +0x076 WaitObjectPointerOffset : Uint2B
    ```

    `dx @$objTypes = (nt!_OBJECT_TYPE*(*)[67])&nt!ObpObjectTypes`