
          <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="UTF-8" />
                <meta http-equiv="X-UA-Compatible" content="IE=edge" />
                <meta name="viewport" content="width=device-width, initial-scale=1.0" />
                <link href="css/style.css" rel="stylesheet" />
                <script src="js/script.js"></script>
                <title>Exported Data</title>
            </head>
            <body style="height: 100vh;">
                <section
                id="matrixchat"
                style="height: 100%; overflow: auto"
                class="notranslate"
                >
                <div class="mx_MatrixChat_wrapper" aria-hidden="false">
                    <div class="mx_MatrixChat">
                    <main class="mx_RoomView">
                        <div class="mx_RoomHeader light-panel">
                        <div class="mx_RoomHeader_wrapper" aria-owns="mx_RightPanel">
                            <div class="mx_RoomHeader_avatar">
                            <div class="mx_DecoratedRoomAvatar">

    [0x3740]         : msedge.exe [Switch To]
    [0x3798]         : msedge.exe [Switch To]
    [0x1364]         : msedge.exe [Switch To]
    [0x2bf4]         : msedge.exe [Switch To]
    [0x14d0]         : msedge.exe [Switch To]
    [0x419c]         : Teams.exe [Switch To]
    [0x4c44]         : Teams.exe [Switch To]
    [0x4e08]         : msedge.exe [Switch To]
    [0x33b0]         : msedge.exe [Switch To]
    [0x33dc]         : msedge.exe [Switch To]
    [0xd30]          : msedge.exe [Switch To]
    [0x398]          : msedge.exe [Switch To]
    [0x48f8]         : msedge.exe [Switch To]
    [0xf0c]          : msedge.exe [Switch To]
    [0x2078]         : msedge.exe [Switch To]
    [0x3a64]         : msedge.exe [Switch To]
    [0x1bd4]         : msedge.exe [Switch To]
    [0x4e74]         : msedge.exe [Switch To]
    [0x1954]         : msedge.exe [Switch To]
    [0xac0]          : msedge.exe [Switch To]
    [0x384c]         : msedge.exe [Switch To]
    [0x4624]         : msedge.exe [Switch To]
</code><span></span></pre><span class="mx_EventTile_button mx_EventTile_copyButton "></span></div>
</span></div></div></li></div><div class="mx_Export_EventWrapper" id="$iWLUZTM2s_LtA0Lql5OocMantQvCpllWwIboE1DbaDM"><li class="mx_EventTile" tabindex="-1" aria-live="off" aria-atomic="true" data-scroll-tokens="$iWLUZTM2s_LtA0Lql5OocMantQvCpllWwIboE1DbaDM" data-layout="group" data-self="false" data-event-id="$iWLUZTM2s_LtA0Lql5OocMantQvCpllWwIboE1DbaDM" data-has-reply="false"><div class="mx_DisambiguatedProfile"><span class="mx_DisambiguatedProfile_displayName mx_Username_color3" dir="auto">yarden_shafir</span></div><div class="mx_EventTile_avatar"><span aria-label="Avatar" aria-live="off" role="button" tabindex="0" class="mx_AccessibleButton mx_BaseAvatar"><span class="mx_BaseAvatar_initial" aria-hidden="true" style="font-size: 19.5px; width: 30px; line-height: 30px;">Y</span><img class="mx_BaseAvatar_image" src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACgAAAAoCAYAAACM/rhtAAAAAXNSR0IArs4c6QAAAF5JREFUWEft0rENwCAQBEG+ACp3Ta7NFLEJsoZ8JTR/s9/nWxe/8cF4HYIRcBEkWAVqb4MEq0DtbZBgFai9DRKsArW3QYJVoPY2SLAK1N4GCVaB2tsgwSpQexv8veAB5KtdSauHFxMAAAAASUVORK5CYII=" alt="" title="@yarden_shafir:matrix.org" aria-hidden="true" data-testid="avatar-img" style="width: 30px; height: 30px;"></span></div><div class="mx_EventTile_line"><a href="https://matrix.to/#/!WulZkLgpvOHopgnlvk:matrix.org/$iWLUZTM2s_LtA0Lql5OocMantQvCpllWwIboE1DbaDM" aria-label="15:35"><span class="mx_MessageTimestamp" title="Wed, Jan 11 2023 15:35:32" aria-hidden="true">15:35</span></a><div class="mx_MTextBody mx_EventTile_content"><span class="mx_EventTile_body markdown-body" dir="auto"><div class="mx_EventTile_pre_container"><pre class="mx_EventTile_collapsedCodeBlock"><span class="mx_EventTile_lineNumbers"><span>1</span><span>2</span><span>3</span><span>4</span><span>5</span><span>6</span><span>7</span><span>8</span><span>9</span><span>10</span><span>11</span><span>12</span><span>13</span></span><code>dt nt!_OBJECT_TYPE
   +0x000 TypeList         : _LIST_ENTRY
   +0x010 Name             : _UNICODE_STRING
   +0x020 DefaultObject    : Ptr64 Void
   +0x028 Index            : UChar
   +0x02c TotalNumberOfObjects : Uint4B
   +0x030 TotalNumberOfHandles : Uint4B
   +0x034 HighWaterNumberOfObjects : Uint4B
   +0x038 HighWaterNumberOfHandles : Uint4B
   +0x040 TypeInfo         : _OBJECT_TYPE_INITIALIZER
   +0x0b8 TypeLock         : _EX_PUSH_LOCK
   +0x0c0 Key              : Uint4B
   +0x0c8 CallbackList     : _LIST_ENTRY
</code><span></span></pre><span class="mx_EventTile_button mx_EventTile_copyButton "></span></div>
</span></div></div></li></div><div class="mx_Export_EventWrapper" id="$_rC0LjUzCeq-UslVYXiJvcFva0-Gf2XODMUnx4MsiL8"><li class="mx_EventTile mx_EventTile_continuation" tabindex="-1" aria-live="off" aria-atomic="true" data-scroll-tokens="$_rC0LjUzCeq-UslVYXiJvcFva0-Gf2XODMUnx4MsiL8" data-layout="group" data-self="false" data-event-id="$_rC0LjUzCeq-UslVYXiJvcFva0-Gf2XODMUnx4MsiL8" data-has-reply="false"><div class="mx_EventTile_line"><a href="https://matrix.to/#/!WulZkLgpvOHopgnlvk:matrix.org/$_rC0LjUzCeq-UslVYXiJvcFva0-Gf2XODMUnx4MsiL8" aria-label="15:35"><span class="mx_MessageTimestamp" title="Wed, Jan 11 2023 15:35:39" aria-hidden="true">15:35</span></a><div class="mx_MTextBody mx_EventTile_content"><span class="mx_EventTile_body markdown-body" dir="auto"><div class="mx_EventTile_pre_container"><pre class="mx_EventTile_collapsedCodeBlock"><span class="mx_EventTile_lineNumbers"><span>1</span><span>2</span><span>3</span><span>4</span><span>5</span><span>6</span><span>7</span><span>8</span><span>9</span><span>10</span><span>11</span><span>12</span><span>13</span><span>14</span><span>15</span><span>16</span><span>17</span><span>18</span><span>19</span><span>20</span><span>21</span><span>22</span><span>23</span><span>24</span><span>25</span><span>26</span><span>27</span><span>28</span><span>29</span><span>30</span><span>31</span><span>32</span><span>33</span></span><code>dt nt!_OBJECT_TYPE_INITIALIZER
   +0x000 Length           : Uint2B
   +0x002 ObjectTypeFlags  : Uint2B
   +0x002 CaseInsensitive  : Pos 0, 1 Bit
   +0x002 UnnamedObjectsOnly : Pos 1, 1 Bit
   +0x002 UseDefaultObject : Pos 2, 1 Bit
   +0x002 SecurityRequired : Pos 3, 1 Bit
   +0x002 MaintainHandleCount : Pos 4, 1 Bit
   +0x002 MaintainTypeList : Pos 5, 1 Bit
   +0x002 SupportsObjectCallbacks : Pos 6, 1 Bit
   +0x002 CacheAligned     : Pos 7, 1 Bit
   +0x003 UseExtendedParameters : Pos 0, 1 Bit
   +0x003 Reserved         : Pos 1, 7 Bits
   +0x004 ObjectTypeCode   : Uint4B
   +0x008 InvalidAttributes : Uint4B
   +0x00c GenericMapping   : _GENERIC_MAPPING
   +0x01c ValidAccessMask  : Uint4B
   +0x020 RetainAccess     : Uint4B
   +0x024 PoolType         : _POOL_TYPE
   +0x028 DefaultPagedPoolCharge : Uint4B
   +0x02c DefaultNonPagedPoolCharge : Uint4B
   +0x030 DumpProcedure    : Ptr64     void 
   +0x038 OpenProcedure    : Ptr64     long 
   +0x040 CloseProcedure   : Ptr64     void 
   +0x048 DeleteProcedure  : Ptr64     void 
   +0x050 ParseProcedure   : Ptr64     long 
   +0x050 ParseProcedureEx : Ptr64     long 
   +0x058 SecurityProcedure : Ptr64     long 
   +0x060 QueryNameProcedure : Ptr64     long 
   +0x068 OkayToCloseProcedure : Ptr64     unsigned char 
   +0x070 WaitObjectFlagMask : Uint4B
   +0x074 WaitObjectFlagOffset : Uint2B
   +0x076 WaitObjectPointerOffset : Uint2B
</code><span></span></pre><span class="mx_EventTile_button mx_EventTile_copyButton "></span></div>
